In [4]:
import sqlalchemy

In [6]:
sqlalchemy.create_engine("sqlite:///fundamentals.db")
%load_ext sql

In [7]:
sql sqlite:///fundamentals.db

***
# CRUD with SQL

***
## Create

In [8]:
%%sql

CREATE TABLE celebs(
    id INTEGER,
    name TEXT,
    age INTEGER
    );

 * sqlite:///fundamentals.db
Done.

[]

***
## Alter

In [7]:
%%sql
ALTER TABLE celebs
ADD COLUMN twitter_username

 * sqlite:///fundamentals.db
Done.

[]

***
## Insert

In [8]:
%%sql

INSERT INTO celebs VALUES (2,"Paris",17, "fi...")

 * sqlite:///fundamentals.db
1 rows affected.

[]

***
## Update

In [9]:
%%sql
UPDATE celebs
SET age = 18
WHERE ID = 2

 * sqlite:///fundamentals.db
1 rows affected.

[]

***
## Delete

In [10]:
%%sql 
DELETE FROM celebs
WHERE twitter_username IS NULL

 * sqlite:///fundamentals.db
0 rows affected.

[]

***
## Select

In [11]:
%%sql 
SELECT * FROM celebs

 * sqlite:///fundamentals.db
Done.

[(2, 'Paris', 18, 'fi...')]

***
# Constrains

In [12]:
%%sql 
CREATE TABLE celebs2 (
   id INTEGER PRIMARY KEY, 
   name TEXT UNIQUE,
   date_of_birth TEXT NOT NULL,
   date_of_death TEXT DEFAULT 'Not Applicable'
);

 * sqlite:///fundamentals.db
Done.

[]

1. **PRIMARY KEY** <span class="mark">columns can be used to uniquely identify the row</span>. Attempts to insert a row with an identical value to a row already in the table will result in a constraint violation which will not allow you to insert the new row.

2. **UNIQUE** <span class="mark">columns have a different value for every row</span>. This is similar to PRIMARY KEY except a table can have many different UNIQUE columns.

3. **NOT NULL** <span class="mark">columns must have a value</span>. Attempts to insert a row without a value for a NOT NULL column will result in a constraint violation and the new row will not be inserted.

4. **DEFAULT** <span class="mark">columns take an additional argument that will be the assumed value for an inserted row if the new row does not specify a value for that column</span>.